karthikeyanvijayakumar25/console/lib/rtems-5.1/bsps/arm/stm32f7/include/bsp/stm32f7xxxx_otgfs.h
/*
 * Copyright (c) 2013 Chris Nott.  All rights reserved.
 *
 *  Virtual Logic
 *  21-25 King St.
 *  Rockdale NSW 2216
 *  Australia
 *  <rtems@vl.com.au>
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rtems.org/license/LICENSE.
 */

#ifndef LIBBSP_ARM_STM32F7_STM32F7XXXX_OTGFS_H
#define LIBBSP_ARM_STM32F7_STM32F7XXXX_OTGFS_H

#include <bsp/utility.h>

#define USB_OTG_NUM_EPS 4
#define USB_OTG_MAX_TX_FIFOS 4

#define USB_FIFO_BASE 0x1000
#define USB_FIFO_OFFS 0x1000

struct stm32f7_otgfs_s {
  uint32_t gotgctl; // 0x00: Control and status register
#define STM32F7_OTGFS_GOTGCTL_BSVLD     BSP_BIT32(19) // B-session valid
#define STM32F7_OTGFS_GOTGCTL_ASVLD     BSP_BIT32(18) // A-session valid
#define STM32F7_OTGFS_GOTGCTL_DBCT      BSP_BIT32(17) // Debounce time
#define STM32F7_OTGFS_GOTGCTL_CIDSTS    BSP_BIT32(16) // Connector ID status
#define STM32F7_OTGFS_GOTGCTL_DHNPEN    BSP_BIT32(11) // Device HNP enable
#define STM32F7_OTGFS_GOTGCTL_HSHNPEN   BSP_BIT32(10) // Host set HNP enable
#define STM32F7_OTGFS_GOTGCTL_HNPRQ     BSP_BIT32(9)  // HNP request
#define STM32F7_OTGFS_GOTGCTL_HNGSCS    BSP_BIT32(8)  // Host negotiation status
#define STM32F7_OTGFS_GOTGCTL_SRQ       BSP_BIT32(1)  // Session request
#define STM32F7_OTGFS_GOTGCTL_SRQSCS    BSP_BIT32(0)  // Session request success

  uint32_t gotgint; // 0x04: Interrupt register
#define STM32F7_OTGFS_GOTGINT_DBCDNE    BSP_BIT32(19) // Debounce done
#define STM32F7_OTGFS_GOTGINT_ADTOCHG   BSP_BIT32(18) // A-device timeout change
#define STM32F7_OTGFS_GOTGINT_HNGDET    BSP_BIT32(17) // Host negotiation detected
#define STM32F7_OTGFS_GOTGINT_HNSSCHG   BSP_BIT32(9)  // Host negotiation success status change
#define STM32F7_OTGFS_GOTGINT_SRSSCHG   BSP_BIT32(8)  // Session request status change
#define STM32F7_OTGFS_GOTGINT_SEDET     BSP_BIT32(2)  // Session end detected

  uint32_t gahbcfg; // 0x08: AHB configuration register
#define STM32F7_OTGFS_GAHBCFG_PTXFELVL  BSP_BIT32(8)  // Periodic txfifo empty level
#define STM32F7_OTGFS_GAHBCFG_TXFELVL   BSP_BIT32(7)  // Txfifo empty level
#define STM32F7_OTGFS_GAHBCFG_GINTMSK   BSP_BIT32(0)  // Global interrupt mask

  uint32_t gusbcfg; // 0x0C: USB configuration register
#define STM32F7_OTGFS_GUSBCFG_CTXPKT    BSP_BIT32(31) // Corrupt TX packet
#define STM32F7_OTGFS_GUSBCFG_FDMOD     BSP_BIT32(30) // Force device mode
#define STM32F7_OTGFS_GUSBCFG_FHMOD     BSP_BIT32(29) // Force host mode
#define STM32F7_OTGFS_GUSBCFG_TRDT(val) BSP_FLD32(val, 10, 13)  // USB turnaround time
#define STM32F7_OTGFS_GUSBCFG_TRDT_GET(reg) BSP_FLD32GET(reg, 10, 13)
#define STM32F7_OTGFS_GUSBCFG_TRDT_SET(reg, val)  BSP_FLD32SET(reg, val, 10, 13)
#define STM32F7_OTGFS_GUSBCFG_HNPCAP    BSP_BIT32(9)  // HNP-capable
#define STM32F7_OTGFS_GUSBCFG_SRPCAP    BSP_BIT32(8)  // SRP-capable
#define STM32F7_OTGFS_GUSBCFG_PHYSEL    BSP_BIT32(6)  // Full speed serial transceiver select
#define STM32F7_OTGFS_GUSBCFG_TOCAL(val)  BSP_FLD32(val, 0, 2)  // FS timeout calibration
#define STM32F7_OTGFS_GUSBCFG_TOCAL_GET(reg)  BSP_FLD32GET(reg, 0, 2)
#define STM32F7_OTGFS_GUSBCFG_TOCAL_SET(reg, val) BSP_FLD32SET(reg, val, 0, 2)

  uint32_t grstctl; // 0x10: Reset register
#define STM32F7_OTGFS_GRSTCTL_AHBIDL    BSP_BIT32(31) // AHB master idle
#define STM32F7_OTGFS_GRSTCTL_TXFNUM(val) BSP_FLD32(val, 6, 10) // Tx fifo number
#define STM32F7_OTGFS_GRSTCTL_TXFNUM_GET(reg) BSP_FLD32GET(reg, 6, 10)
#define STM32F7_OTGFS_GRSTCTL_TXFNUM_SET(reg, val)  BSP_FLD32SET(reg, val, 6, 10)
#define STM32F7_OTGFS_GRSTCTL_TXFNUM_ALL  STM32F7_OTGFS_GRSTCTL_TXFNUM(0x10)
#define STM32F7_OTGFS_GRSTCTL_TXFFLSH   BSP_BIT32(5)  // TX fifo flush
#define STM32F7_OTGFS_GRSTCTL_RXFFLSH   BSP_BIT32(4)  // RX fifo flush
#define STM32F7_OTGFS_GRSTCTL_FCRST     BSP_BIT32(2)  // Host frame counter reset
#define STM32F7_OTGFS_GRSTCTL_HSRST     BSP_BIT32(1)  // HCLK soft reset
#define STM32F7_OTGFS_GRSTCTL_CSRST     BSP_BIT32(0)  // Core soft reset

  uint32_t gintsts; // 0x14: Core interrupt register
#define STM32F7_OTGFS_GINTSTS_WKUPINT   BSP_BIT32(31) // Resume / remote wakeup detected interrupt
#define STM32F7_OTGFS_GINTSTS_SRQINT    BSP_BIT32(30) // Session request / new session detected interrupt
#define STM32F7_OTGFS_GINTSTS_DISCINT   BSP_BIT32(29) // Disconnect detected interrupt
#define STM32F7_OTGFS_GINTSTS_CIDSCHG   BSP_BIT32(28) // Connector ID status change
#define STM32F7_OTGFS_GINTSTS_PTXFE     BSP_BIT32(26) // Periodic TX fifo empty
#define STM32F7_OTGFS_GINTSTS_HCINT     BSP_BIT32(25) // Host channels interrupt
#define STM32F7_OTGFS_GINTSTS_HPRTINT   BSP_BIT32(24) // Host port interrupt
#define STM32F7_OTGFS_GINTSTS_IPXFR     BSP_BIT32(21) // Incomplete periodic transfer
#define STM32F7_OTGFS_GINTSTS_IISOOXFR  BSP_BIT32(21) // Incomplete isochronous OUT transfer
#define STM32F7_OTGFS_GINTSTS_IISOIXFR  BSP_BIT32(20) // Incomplete isochronous IN transfer
#define STM32F7_OTGFS_GINTSTS_OEPINT    BSP_BIT32(19) // OUT endpoint interrupt
#define STM32F7_OTGFS_GINTSTS_IEPINT    BSP_BIT32(18) // IN endpoint interrupt
#define STM32F7_OTGFS_GINTSTS_EOPF      BSP_BIT32(15) // End of periodic frame interrupt
#define STM32F7_OTGFS_GINTSTS_ISOODRP   BSP_BIT32(14) // Isochronous OUT packet dropped interrupt
#define STM32F7_OTGFS_GINTSTS_ENUMDNE   BSP_BIT32(13) // Enumeration done
#define STM32F7_OTGFS_GINTSTS_USBRST    BSP_BIT32(12) // USB reset
#define STM32F7_OTGFS_GINTSTS_USBSUSP   BSP_BIT32(11) // USB suspend
#define STM32F7_OTGFS_GINTSTS_ESUSP     BSP_BIT32(10) // Early suspend
#define STM32F7_OTGFS_GINTSTS_GONAKEFF  BSP_BIT32(7)  // Global OUT NAK effective
#define STM32F7_OTGFS_GINTSTS_GINAKEFF  BSP_BIT32(6)  // Global IN non-periodic NAK effective
#define STM32F7_OTGFS_GINTSTS_NPTXFE    BSP_BIT32(5)  // Non-periodic TX fifo empty
#define STM32F7_OTGFS_GINTSTS_RXFLVL    BSP_BIT32(4)  // RX fifo non-empty
#define STM32F7_OTGFS_GINTSTS_SOF       BSP_BIT32(3)  // Start of frame
#define STM32F7_OTGFS_GINTSTS_OTGINT    BSP_BIT32(2)  // OTG interrupt
#define STM32F7_OTGFS_GINTSTS_MMIS      BSP_BIT32(1)  // Mode mismatch interrupt
#define STM32F7_OTGFS_GINTSTS_CMOD      BSP_BIT32(0)  // Current mode of operation

  uint32_t gintmsk; // 0x18: Interrupt mask register

  uint32_t grxstsr; // 0x1C: Receive status debug read

  uint32_t grxstsp; // 0x20: OTG status read and pop
#define STM32F7_OTGFS_GRXSTSP_FRMNUM(val) BSP_FLD32(val, 21, 24)  // Frame number
#define STM32F7_OTGFS_GRXSTSP_FRMNUM_GET(reg) BSP_FLD32GET(reg, 21, 24)
#define STM32F7_OTGFS_GRXSTSP_FRMNUM_SET(reg, val)  BSP_FLD32SET(reg, val, 21, 24)
#define STM32F7_OTGFS_GRXSTSP_PKTSTS(val) BSP_FLD32(val, 17, 20)  // Packet status
#define STM32F7_OTGFS_GRXSTSP_PKTSTS_GET(reg) BSP_FLD32GET(reg, 17, 20)
#define STM32F7_OTGFS_GRXSTSP_PKTSTS_SET(reg, val)  BSP_FLD32SET(reg, val, 17, 20)
#define PKTSTS_IN_DATA  (0x2)
#define PKTSTS_IN_COMPLETE  (0x3)
#define PKTSTS_TOGGLE_ERR (0x5)
#define PKTSTS_HALTED (0x7)
#define PKTSTS_OUTNAK (0x1)
#define PKTSTS_OUT_DATA (0x2)
#define PKTSTS_OUT_COMPLETE (0x3)
#define PKTSTS_SETUP_COMPLETE (0x4)
#define PKTSTS_SETUP_DATA (0x6)
#define STM32F7_OTGFS_GRXSTSP_DPIG(val) BSP_FLD32(val, 15, 16)  // Data PID
#define STM32F7_OTGFS_GRXSTSP_DPID_GET(reg) BSP_FLD32GET(reg, 15, 16)
#define STM32F7_OTGFS_GRXSTSP_DPID_SET(reg, val)  BSP_FLD32SET(reg, val, 15, 16)
#define STM32F7_OTGFS_GRXSTSP_DPID_DATA0  STM32F7_OTGFS_GRXSTSP_PKTSTS(0x0)
#define STM32F7_OTGFS_GRXSTSP_DPID_DATA1  STM32F7_OTGFS_GRXSTSP_PKTSTS(0x1)
#define STM32F7_OTGFS_GRXSTSP_DPID_DATA2  STM32F7_OTGFS_GRXSTSP_PKTSTS(0x2)
#define STM32F7_OTGFS_GRXSTSP_DPID_MDATA0 STM32F7_OTGFS_GRXSTSP_PKTSTS(0x3)
#define STM32F7_OTGFS_GRXSTSP_BCNT(val) BSP_FLD32(val, 4, 14) // Byte count
#define STM32F7_OTGFS_GRXSTSP_BCNT_GET(reg) BSP_FLD32GET(reg, 4, 14)
#define STM32F7_OTGFS_GRXSTSP_BCNT_SET(reg, val)  BSP_FLD32SET(reg, val, 4, 14)
#define STM32F7_OTGFS_GRXSTSP_CHNUM(val)  BSP_FLD32(val, 0, 3)  // Channel number
#define STM32F7_OTGFS_GRXSTSP_CHNUM_GET(reg)  BSP_FLD32GET(reg, 0, 3)
#define STM32F7_OTGFS_GRXSTSP_CHNUM_SET(reg, val) BSP_FLD32SET(reg, val, 0, 3)
#define STM32F7_OTGFS_GRXSTSP_EPNUM(val)  BSP_FLD32(val, 0, 3)  // Endpoint number
#define STM32F7_OTGFS_GRXSTSP_EPNUM_GET(reg)  BSP_FLD32GET(reg, 0, 3)
#define STM32F7_OTGFS_GRXSTSP_EPNUM_SET(reg, val) BSP_FLD32SET(reg, val, 0, 3)

